rupa/z
zsh-users/zsh-completions

romkatv/zsh-bench kind:path
olets/zsh-abbr    kind:defer

ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/magic-enter


# antigen theme mh
# antigen theme blinks
# prompts:
#   with prompt plugins, remember to add this to your .zshrc:
#   `autoload -Uz promptinit && promptinit && prompt pure`
sindresorhus/pure     kind:fpath
romkatv/powerlevel10k kind:fpath


# if [[ "$(uname)" == "Linux" ]]; then
#  command-not-found  # Ubuntu only
# fi
# if [[ "$(uname)" == "Darwin" ]]; then
	ohmyzsh/ohmyzsh path:plugins/macos  # OSX only
# fi

ohmyzsh/ohmyzsh path:plugins/safe-paste
ohmyzsh/ohmyzsh path:plugins/common-aliases
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/brew
# ohmyzsh/ohmyzsh path:plugins/scala/_scala
ohmyzsh/ohmyzsh path:plugins/sbt
ohmyzsh/ohmyzsh path:plugins/mvn
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/jsontools
ohmyzsh/ohmyzsh path:plugins/cabal
Tarrasch/zsh-autoenv
Tarrasch/zsh-functional

darvid/zsh-poetry

# popular fish-like plugins
mattmc3/zfunctions
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search
